app/Http/Controllers/Auth/AuthController.php

insert into "users" ("name", "email", "phone", "password", "locale", "updated_at", "created_at") values ('Test User', 'testorder@example.com', '01712345678', '$2y$12$TIfgp8enVgl8QdtK1JSJy.1QPIIeH1.Zqf9igXcDlQ7izv1v9LbOy', 'en', '2026-05-20 09:31:33', '2026-05-20 09:31:33')
---
    public function register(Request $request): RedirectResponse
    {
        $data = $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'phone' => ['nullable', 'string', new BdPhone()],
            'password' => ['required', 'confirmed', Password::defaults()],
        ]);

        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'phone' => $data['phone'] ?? null,
            'password' => Hash::make($data['password']),
            'locale' => app()->getLocale(),
        ]);