app/Services/CheckoutService.php

    public function placeOrder(
        User $user,
        Cart $cart,
        array $shippingAddress,
        string $paymentMethod,
    ): Order {
        $this->validateStock($cart);

        return DB::transaction(function () use ($user, $cart, $shippingAddress, $paymentMethod) {
            $subtotal = $cart->subtotal;
            $discount = 0;
            $coupon = $cart->coupon;

            if ($coupon && $coupon->isValid($user)) {
                $discount = $coupon->calculateDiscount($cart);
                $this->couponService->incrementUsage($coupon);
            }

            $shipping = $this->shippingService->isFreeShipping($subtotal - $discount)
                ? 0
                : $this->shippingService->calculate(
                    $shippingAddress['division'] ?? '',
                    $shippingAddress['city'] ?? null,
                );

            $total = max(0, $subtotal - $discount + $shipping);
            $shippingAddress['delivery_time'] = $this->shippingService->getDeliveryTime();
            $shippingAddress['delivery_partner'] = $this->shippingService->getDeliveryPartner();

            $order = Order::create([
                'user_id' => $user->id,
                'status' => 'pending',
                'payment_status' => 'unpaid',
                'payment_method' => $paymentMethod,
                'subtotal' => $subtotal,
                'discount_amount' => $discount,
                'shipping_amount' => $shipping,
                'tax_amount' => 0,
                'total' => $total,
                'coupon_id' => $coupon?->id,
                'shipping_address' => $shippingAddress,
            ]);

            foreach ($cart->items as $item) {
                $order->items()->create([
                    'product_id' => $item->product_id,
                    'variant_id' => $item->variant_id,
                    'product_name' => $item->product->name,
                    'product_sku' => $item->variant?->sku ?? $item->product->sku,
                    'quantity' => $item->quantity,
                    'unit_price' => $item->unit_price,
                    'total_price' => $item->unit_price * $item->quantity,
                ]);
---
insert into "orders" ("user_id", "status", "payment_status", "payment_method", "subtotal", "discount_amount", "shipping_amount", "tax_amount", "total", "coupon_id", "shipping_address", "order_number", "updated_at", "created_at") values (2, 'pending', 'unpaid', 'cod', 3800, 0, 0, 0, 3800, null, '{"full_name":"Breanna Downs","phone":"+1 (388) 425-3639","address_line_1":"123 Main Street","address_line_2":"Apt 4B","city":"Dhaka","district":"Dhaka","division":"Dhaka","postal_code":"1212","payment_method":"cod","notes":null}', 'GNG-20260520-ZV0E', '2026-05-20 09:47:40', '2026-05-20 09:47:40')
insert into "order_items" ("product_id", "variant_id", "product_name", "product_sku", "quantity", "unit_price", "total_price", "order_id", "updated_at", "created_at") values (1, null, 'Fantech MaxFit61 Mechanical Keyboard', 'DIT-KB-0001', 1, '3800.00', 3800, 2, '2026-05-20 09:47:40', '2026-05-20 09:47:40')