app/Observers/OrderObserver.php

    private function generateOrderNumber(): string
    {
        $prefix = 'GNG';
        $date = now()->format('Ymd');
        $random = strtoupper(Str::random(4));

        $number = "{$prefix}-{$date}-{$random}";

        // Ensure uniqueness
        while (Order::where('order_number', $number)->exists()) {
---
select exists(select * from "orders" where "order_number" = 'GNG-20260520-ZV0E' and "orders"."deleted_at" is null) as "exists"