app/Payments/CodGateway.php

    public function initiate(Order $order): array
    {
        Payment::create([
            'order_id' => $order->id,
            'transaction_id' => 'COD-' . strtoupper(Str::random(10)),
            'payment_method' => 'cod',
            'amount' => $order->total,
            'currency' => 'BDT',
            'status' => 'pending',
        ]);
---
insert into "payments" ("order_id", "transaction_id", "payment_method", "amount", "currency", "status", "updated_at", "created_at") values (2, 'COD-T24FI7C28W', 'cod', '3800.00', 'BDT', 'pending', '2026-05-20 09:47:40', '2026-05-20 09:47:40')