app/Payments/SslCommerzGateway.php

    public function verify(Request $request): Payment
    {
        $payment = Payment::where('transaction_id', $request->get('tran_id'))->firstOrFail();

        $validationResponse = Http::get($this->getApiUrl('validator/api/validationserverAPI.php'), [
            'val_id' => $request->get('val_id'),
            'store_id' => $this->storeId,
            'store_passwd' => $this->storePassword,
        ]);

        $result = $validationResponse->json();

        if ($result['status'] === 'VALID' || $result['status'] === 'VALIDATED') {
            $payment->update([
                'status' => 'completed',
                'paid_at' => now(),
                'gateway_response' => $result,
            ]);
            $payment->order->update(['payment_status' => 'paid', 'status' => 'confirmed']);
---
select * from "payments" where "transaction_id" = 'DIN-JZGITIMFN1KA' limit 1
select * from "orders" where "orders"."id" = 11 and "orders"."deleted_at" is null limit 1
update "orders" set "status" = 'confirmed', "payment_status" = 'paid', "updated_at" = '2026-05-20 10:28:02' where "id" = 11