app/Filament/Widgets/RevenueChart.php

    protected function getData(): array
    {
        $days   = collect();
        $labels = [];
        $data   = [];

        for ($i = 29; $i >= 0; $i--) {
            $date = Carbon::today()->subDays($i);
            $days->put($date->format('Y-m-d'), 0);
            $labels[] = $date->format('d M');
        }

        Order::selectRaw('DATE(created_at) as date, SUM(total) as revenue')
            ->where('payment_status', PaymentStatus::Paid)
            ->whereDate('created_at', '>=', Carbon::today()->subDays(29))
            ->groupBy('date')
            ->orderBy('date')
            ->get()
            ->each(function ($row) use (&$days): void {
                $days->put($row->date, round((float) $row->revenue, 2));
            });
---
select DATE(created_at) as date, SUM(total) as revenue from "orders" where "payment_status" = 'paid' and strftime('%Y-%m-%d', "created_at") >= cast('2026-04-21' as text) and "orders"."deleted_at" is null group by "date" order by "date" asc