app/Filament/Widgets/StatsOverview.php

    protected function getStats(): array
    {
        $today = Carbon::today();

        $todayOrdersCount = Order::whereDate('created_at', $today)->count();

        $todayRevenue = Order::whereDate('created_at', $today)
            ->where('payment_status', PaymentStatus::Paid)
            ->sum('total');

        $yesterdayRevenue = Order::whereDate('created_at', $today->copy()->subDay())
            ->where('payment_status', PaymentStatus::Paid)
            ->sum('total');

        $revenueChange = $yesterdayRevenue > 0
            ? round((($todayRevenue - $yesterdayRevenue) / $yesterdayRevenue) * 100, 1)
            : 0;

        $totalCustomers = User::count();

        $newCustomersThisMonth = User::whereMonth('created_at', $today->month)
            ->whereYear('created_at', $today->year)
            ->count();

        $pendingOrders = Order::where('status', OrderStatus::Pending)->count();

        $lastWeekPending = Order::where('status', OrderStatus::Pending)
            ->where('created_at', '<', $today->copy()->subWeek())
            ->count();

        return [
            Stat::make("Today's Orders", (string) $todayOrdersCount)
                ->description('Orders placed today')
                ->descriptionIcon('heroicon-m-shopping-bag')
                ->color('primary')
                ->chart(
                    Order::selectRaw('DATE(created_at) as date, COUNT(*) as count')
                        ->whereDate('created_at', '>=', $today->copy()->subDays(6))
                        ->groupBy('date')
                        ->orderBy('date')
                        ->pluck('count')
                        ->toArray()
                ),

            Stat::make("Today's Revenue", '৳' . number_format((float) $todayRevenue, 2))
                ->description($revenueChange >= 0
                    ? "{$revenueChange}% increase from yesterday"
                    : abs($revenueChange) . "% decrease from yesterday")
                ->descriptionIcon($revenueChange >= 0 ? 'heroicon-m-arrow-trending-up' : 'heroicon-m-arrow-trending-down')
                ->color($revenueChange >= 0 ? 'success' : 'danger')
                ->chart(
                    Order::selectRaw('DATE(created_at) as date, SUM(total) as revenue')
                        ->where('payment_status', PaymentStatus::Paid)
                        ->whereDate('created_at', '>=', $today->copy()->subDays(6))
                        ->groupBy('date')
                        ->orderBy('date')
                        ->pluck('revenue')
                        ->map(fn ($v) => (float) $v)
                        ->toArray()
                ),

            Stat::make('Total Customers', number_format($totalCustomers))
                ->description("{$newCustomersThisMonth} new this month")
                ->descriptionIcon('heroicon-m-user-plus')
                ->color('info')
                ->chart(
                    User::selectRaw('DATE(created_at) as date, COUNT(*) as count')
                        ->whereDate('created_at', '>=', $today->copy()->subDays(6))
                        ->groupBy('date')
                        ->orderBy('date')
                        ->pluck('count')
                        ->toArray()
                ),
---
select count(*) as aggregate from "orders" where strftime('%Y-%m-%d', "created_at") = cast('2026-05-20' as text) and "orders"."deleted_at" is null
select sum("total") as aggregate from "orders" where strftime('%Y-%m-%d', "created_at") = cast('2026-05-20' as text) and "payment_status" = 'paid' and "orders"."deleted_at" is null
select sum("total") as aggregate from "orders" where strftime('%Y-%m-%d', "created_at") = cast('2026-05-19' as text) and "payment_status" = 'paid' and "orders"."deleted_at" is null
select count(*) as aggregate from "users" where "users"."deleted_at" is null
select count(*) as aggregate from "users" where strftime('%m', "created_at") = cast('05' as text) and strftime('%Y', "created_at") = cast(2026 as text) and "users"."deleted_at" is null
select count(*) as aggregate from "orders" where "status" = 'pending' and "orders"."deleted_at" is null
select count(*) as aggregate from "orders" where "status" = 'pending' and "created_at" < '2026-05-13 00:00:00' and "orders"."deleted_at" is null
select DATE(created_at) as date, COUNT(*) as count from "orders" where strftime('%Y-%m-%d', "created_at") >= cast('2026-05-14' as text) and "orders"."deleted_at" is null group by "date" order by "date" asc
select DATE(created_at) as date, SUM(total) as revenue from "orders" where "payment_status" = 'paid' and strftime('%Y-%m-%d', "created_at") >= cast('2026-05-14' as text) and "orders"."deleted_at" is null group by "date" order by "date" asc
select DATE(created_at) as date, COUNT(*) as count from "users" where strftime('%Y-%m-%d', "created_at") >= cast('2026-05-14' as text) and "users"."deleted_at" is null group by "date" order by "date" asc