app/Repositories/Eloquent/CartRepository.php

insert into "carts" ("user_id", "updated_at", "created_at") values (2, '2026-05-20 08:53:30', '2026-05-20 08:53:30')
select * from "cart_items" where "cart_items"."cart_id" in (3)
select * from "carts" where ("user_id" = 2) limit 1
select * from "products" where "products"."id" in (1) and "products"."deleted_at" is null
insert into "carts" ("session_id", "updated_at", "created_at") values ('54gZNFSrg5euWGd6kndsHTZsv2Xr3w8sExRUl7pj', '2026-05-20 09:04:21', '2026-05-20 09:04:21')
select * from "cart_items" where "cart_items"."cart_id" in (2)
select * from "carts" where ("session_id" = '54gZNFSrg5euWGd6kndsHTZsv2Xr3w8sExRUl7pj') limit 1
---
    public function getOrCreateForUser(?int $userId, ?string $sessionId): Cart
    {
        if ($userId) {
            return Cart::with('items.product')->firstOrCreate(['user_id' => $userId]);
        }

        return Cart::with('items.product')->firstOrCreate(['session_id' => $sessionId]);

select * from "products" where "products"."id" = 2 and "products"."deleted_at" is null limit 1
select * from "cart_items" where "cart_items"."cart_id" = 3 and "cart_items"."cart_id" is not null and "product_id" = 2 and "variant_id" is null limit 1
insert into "cart_items" ("product_id", "variant_id", "quantity", "unit_price", "cart_id", "updated_at", "created_at") values (2, null, 1, '3200.00', 3, '2026-05-20 08:53:53', '2026-05-20 08:53:53')
---
    public function addItem(Cart $cart, int $productId, int $quantity, ?int $variantId = null): CartItem
    {
        $product = Product::findOrFail($productId);
        $price = $product->selling_price;

        if ($variantId) {
            $variant = $product->variants()->findOrFail($variantId);
            if ($variant->price > 0) {
                // If variant has an absolute override price, use it
                $price = $variant->price;
            } else {
                // Otherwise apply modifier to product's discounted price
                $price = $price + $variant->price_modifier;
            }
        }

        $existing = $cart->items()
            ->where('product_id', $productId)
            ->where('variant_id', $variantId)
            ->first();

        if ($existing) {
            $existing->increment('quantity', $quantity);
            return $existing->fresh();
        }

        return $cart->items()->create([
            'product_id' => $productId,
            'variant_id' => $variantId,
            'quantity' => $quantity,
            'unit_price' => $price,
        ]);

delete from "cart_items" where "cart_id" = 3
---
    public function removeItem(int $cartItemId): void
    {
        CartItem::findOrFail($cartItemId)->delete();