app/Repositories/Eloquent/CategoryRepository.php

    public function getTree(): Collection
    {
        return Category::with(['translations', 'children.translations'])
            ->whereNull('parent_id')
            ->active()
            ->orderBy('sort_order')
            ->get();
---
select * from "categories" where "categories"."parent_id" in (1, 5, 9, 13, 17, 21, 25)

    public function getWithProductCount(): Collection
    {
        return Category::with(['translations', 'children.translations'])
            ->whereNull('parent_id')
            ->withCount('products')
            ->active()
            ->orderBy('sort_order')
            ->get();
---
select * from "categories" where "categories"."parent_id" in (1, 5, 9, 13, 17, 21, 25)