app/Repositories/Eloquent/OrderRepository.php

select count(*) as aggregate from "orders" where "user_id" = 2 and "orders"."deleted_at" is null
---
    public function getByUser(int $userId, int $perPage = 10): LengthAwarePaginator
    {
        return Order::with(['items', 'payment'])
            ->where('user_id', $userId)
            ->latest()
            ->paginate($perPage);