app/Repositories/Eloquent/ProductRepository.php

select * from "categories" where "categories"."id" in (2, 6, 10, 12, 14, 18, 22, 26)
---
    public function getActive(array $filters = [], int $perPage = 16): LengthAwarePaginator
    {
        $query = Product::with(['translations', 'images', 'category'])
            ->active();

        $this->applyFilters($query, $filters);

        return $query->paginate($perPage);

select * from "categories" where "categories"."id" in (2, 6, 10, 14)
---
    public function getFeatured(int $limit = 8): Collection
    {
        return Product::with(['translations', 'images', 'category.translations'])
            ->withAvg(['reviews' => fn($q) => $q->where('is_approved', true)], 'rating')
            ->active()
            ->featured()
            ->latest()
            ->limit($limit)
            ->get();

select * from "categories" where "categories"."id" in (10, 12, 14, 18, 22, 26)
---
    public function getNewArrivals(int $limit = 8): Collection
    {
        return Product::with(['translations', 'images', 'category.translations'])
            ->withAvg(['reviews' => fn($q) => $q->where('is_approved', true)], 'rating')
            ->active()
            ->newArrivals()
            ->latest()
            ->limit($limit)
            ->get();

select * from "categories" where "categories"."id" in (12)
select * from "products" where "slug" = 'fantech-gs201-rgb-desktop-speakers' and "products"."deleted_at" is null limit 1
select * from "reviews" where "reviews"."product_id" in (10)
---
    public function findBySlug(string $slug): ?Product
    {
        return Product::with(['translations', 'images', 'variants', 'category', 'reviews.user'])
            ->where('slug', $slug)
            ->first();

select * from "products" where "products"."id" = 1 and "products"."deleted_at" is null limit 1
update "products" set "stock_quantity" = "stock_quantity" - 1, "updated_at" = '2026-05-20 09:47:40' where "id" = 1
---
    public function updateStock(int $productId, int $quantity, bool $decrement = true): void
    {
        $product = Product::findOrFail($productId);

        if ($decrement) {
            $product->decrement('stock_quantity', $quantity);