app/Http/Controllers/Frontend/BlogController.php

    public function index(Request $request): View
    {
        $query = Blog::with(['translations', 'author', 'category'])->published()->latest();

        if ($request->filled('category')) {
            $query->whereHas('category', fn ($q) => $q->where('slug', $request->get('category')));
        }

        return view('blog.index', [
            'blogs' => $query->paginate(12),
            'categories' => BlogCategory::with('translations')->withCount('blogs')->get(),
        ]);
---
select * from "blog_categories" where "blog_categories"."id" in (1)
select * from "blog_translations" where "blog_translations"."blog_id" in (1)

    public function show(string $slug): View
    {
        $blog = Blog::with(['translations', 'author', 'category.translations', 'comments' => function ($query) {
            $query->where('is_approved', true)->latest();
        }])
            ->published()
            ->where('slug', $slug)
            ->firstOrFail();
---
select * from "blog_categories" where "blog_categories"."id" in (2)
select * from "blog_translations" where "blog_translations"."blog_id" in (2)