app/Http/Controllers/Frontend/CartController.php

    public function index(): View
    {
        $cart = $this->cartService->getCart()->load(
            'items.product.images',
            'items.product.category.translations',
            'items.variant',
            'coupon',
        );
---
select * from "cart_items" where "cart_items"."cart_id" in (3)
select * from "products" where "products"."id" in (2) and "products"."deleted_at" is null