app/Http/Controllers/Frontend/CheckoutController.php

    public function success(string $orderNumber): View
    {
        $order = auth()->user()->orders()
            ->with(['items.product', 'payment'])
            ->where('order_number', $orderNumber)
            ->firstOrFail();
---
select * from "orders" where "orders"."user_id" = 2 and "orders"."user_id" is not null and "order_number" = 'GNG-20260520-YAML' and "orders"."deleted_at" is null limit 1