app/Http/Controllers/Frontend/CheckoutController.php

    public function index(): View|RedirectResponse
    {
        if (! auth()->check() && ! $this->guestCheckoutEnabled()) {
            return redirect()->guest(route('login'));
        }

        $cart = $this->cartService->getCart()->load('items.product.images', 'coupon');
        $discount = $cart->coupon && $cart->coupon->isValid()
            ? $cart->coupon->calculateDiscount($cart->subtotal)
            : 0;
        $orderValue = max(0, $cart->subtotal - $discount);

        return view('checkout.index', [
            'cart' => $cart,
            'addresses' => auth()->user()?->addresses ?? collect(),
            'guestCheckoutEnabled' => $this->guestCheckoutEnabled(),
            'orderValue' => $orderValue,
            'freeShippingThreshold' => (float) Setting::get('free_shipping_threshold', 1500),
            'dhakaCityShippingCharge' => $this->shippingService->getDhakaCityCharge(),
            'outsideDhakaShippingCharge' => $this->shippingService->getOutsideDhakaCharge(),
            'deliveryTime' => $this->shippingService->getDeliveryTime(),
            'deliveryPartner' => $this->shippingService->getDeliveryPartner(),
        ]);
---
select * from "cart_items" where "cart_items"."cart_id" in (3)
select * from "products" where "products"."id" in (1) and "products"."deleted_at" is null
select * from "addresses" where "addresses"."user_id" = 2 and "addresses"."user_id" is not null

    public function store(CheckoutRequest $request): RedirectResponse
    {
        if (! auth()->check() && ! $this->guestCheckoutEnabled()) {
            return redirect()->guest(route('login'));
        }

        try {
            $cart = $this->cartService->getCart()->load('items.product');
---
select * from "products" where "products"."id" in (1) and "products"."deleted_at" is null