app/Http/Controllers/Frontend/HomeController.php

    public function index(): View
    {
        $locale = app()->getLocale();
        $data = \Illuminate\Support\Facades\Cache::remember("homepage_data_{$locale}", 3600, function () {
            return [
                'heroBanners' => Banner::with('translations')->active()->where('type', 'hero_slider')->orderBy('sort_order')->get(),
                'promoBanners' => Banner::with('translations')->active()->where('type', 'promotional')->orderBy('sort_order')->get(),
                'categories' => $this->categoryRepository->getWithProductCount(),
                'featured' => $this->productRepository->getFeatured(8),
                'newArrivals' => $this->productRepository->getNewArrivals(8),
                'reviews' => Review::with(['user', 'product.translations', 'product.images'])->approved()->latest()->limit(6)->get(),
                'blogs' => Blog::with(['translations', 'category.translations'])->published()->latest()->limit(3)->get(),
---
select * from "blog_categories" where "blog_categories"."id" in (1, 2, 3)
select * from "blog_translations" where "blog_translations"."blog_id" in (1, 2, 3)