app/Filament/Resources/CategoryResource.php

    public static function table(Table $table): Table
    {
        return $table
            ->columns([
                Tables\Columns\ImageColumn::make('image')
                    ->label('Image')
                    ->disk('public')
                    ->circular()
                    ->defaultImageUrl('/images/placeholder.png'),
                Tables\Columns\TextColumn::make('name')
                    ->label('Name')
                    ->formatStateUsing(function ($state, $record): string {
                        return $record->parent_id ? '↳ ' . $state : $state;
                    })
                    ->searchable(query: function ($query, string $value): void {
                        $query->whereHas('translations', fn ($q) => $q->where('name', 'like', "%{$value}%"));
                    })
                    ->sortable(),
                Tables\Columns\TextColumn::make('parent.name')
                    ->label('Parent Category')
                    ->placeholder('— (Top Level)')
                    ->badge()
                    ->color('gray')
                    ->sortable(),
                Tables\Columns\TextColumn::make('slug')
                    ->label('Slug')
                    ->searchable()
                    ->toggleable(isToggledHiddenByDefault: true),
                Tables\Columns\TextColumn::make('sort_order')
                    ->label('Order')
                    ->sortable(),
                Tables\Columns\TextColumn::make('children_count')
                    ->label('Subcategories')
                    ->counts('children')
                    ->badge()
                    ->color(fn (int $state): string => $state > 0 ? 'success' : 'gray'),
                Tables\Columns\ToggleColumn::make('is_active')
                    ->label('Active'),
            ])
            ->defaultSort('sort_order')
            ->groups([
                Tables\Grouping\Group::make('parent.name')
                    ->label('Parent Category')
                    ->collapsible(),
            ])
            ->filters([
                Tables\Filters\TernaryFilter::make('is_active')
                    ->label('Active Status')
                    ->trueLabel('Active Only')
                    ->falseLabel('Inactive Only'),
---
select * from "categories" where "parent_id" is null