app/Filament/Resources/CategoryResource.php

                        ->maxLength(255)
                        ->unique(Category::class, 'slug', ignoreRecord: true)
                        ->disabled(fn ($record) => $record?->is_locked),
                    Forms\Components\Select::make('parent_id')
                        ->label('Parent Category')
                        ->options(
                            Category::whereNull('parent_id')
                                ->with('translations')
                                ->get()
                                ->mapWithKeys(fn($c) => [$c->id => (string) ($c->name ?? 'Category #'.$c->id)])
                        )
                        ->searchable()
                        ->nullable()
                        ->placeholder('None (Top Level)')
                        ->disabled(fn ($record) => $record?->is_locked),
---
select * from "categories" where "parent_id" is null