app/Filament/Resources/ProductResource.php

select * from "categories" where "parent_id" is null
select * from "categories"
select * from "categories" where "parent_id" = 1 or "id" = 1
---
    public static function form(Form $form): Form
    {
        return $form->schema([
            Forms\Components\Tabs::make('Product')->tabs([

                Forms\Components\Tabs\Tab::make('General')->schema([
                    Forms\Components\Grid::make(2)->schema([
                        Forms\Components\TextInput::make('translations.en.name')
                            ->label('Name (English)')
                            ->required()
                            ->maxLength(255)
                            ->live(onBlur: true)
                            ->afterStateUpdated(fn (string $operation, $state, Forms\Set $set) => $operation === 'create' ? $set('slug', \Illuminate\Support\Str::slug($state)) : null),
                        Forms\Components\TextInput::make('translations.bn.name')
                            ->label('Name (বাংলা)')
                            ->maxLength(255),
                    ]),
                    Forms\Components\Grid::make(2)->schema([
                        Forms\Components\Select::make('parent_category_id')
                            ->label('Parent Category')
                            ->options(fn () => Category::whereNull('parent_id')->with('translations')->get()->mapWithKeys(fn($c) => [$c->id => (string) ($c->name ?? 'Category #'.$c->id)]))
                            ->live()
                            ->dehydrated(false)
                            ->afterStateUpdated(fn (Forms\Set $set) => $set('category_id', null))
                            ->afterStateHydrated(function (Forms\Components\Select $component, ?Product $record) {
                                if ($record && $record->category) {
                                    $component->state($record->category->parent_id ?? $record->category_id);
                                }
                            }),
                        Forms\Components\Select::make('category_id')
                            ->label('Category / Subcategory')
                            ->options(function (Forms\Get $get) {
                                $parentId = $get('parent_category_id');
                                if (! $parentId) {
                                    return Category::with('translations')->get()->mapWithKeys(fn($c) => [$c->id => (string) ($c->name ?? 'Category #'.$c->id)]);
                                }
                                return Category::where('parent_id', $parentId)
                                    ->orWhere('id', $parentId)
                                    ->with('translations')
                                    ->get()
                                    ->mapWithKeys(fn($c) => [$c->id => (string) ($c->name ?? 'Category #'.$c->id)]);