app/Filament/Resources/ReviewResource.php

select * from "products" where "products"."deleted_at" is null
---
                        '2' => '2 Stars',
                        '1' => '1 Star',
                    ]),
                Tables\Filters\SelectFilter::make('product_id')
                    ->label('Product')
                    ->options(
                        Product::with('translations')
                            ->get()
                            ->mapWithKeys(fn($p) => [$p->id => (string) ($p->name ?? 'Product #'.$p->id)])
                    )
                    ->searchable(),