app/Models/Cart.php

select * from "cart_items" where "cart_items"."cart_id" = 8 and "cart_items"."cart_id" is not null
---
    public function getSubtotalAttribute(): float
    {
        return $this->items->sum(fn (CartItem $item) => $item->unit_price * $item->quantity);