app/Models/Product.php

select avg("rating") as aggregate from "reviews" where "reviews"."product_id" = 1 and "reviews"."product_id" is not null and "is_approved" = 1
---
    public function getAverageRatingAttribute(): float
    {
        if (array_key_exists('reviews_avg_rating', $this->attributes)) {
            return round((float) ($this->attributes['reviews_avg_rating'] ?? 0), 1);
        }
        return round($this->reviews()->where('is_approved', true)->avg('rating') ?? 0, 1);