app/Models/Setting.php

select * from "settings" where "key" = 'site_tagline' limit 1
---
    public static function get(string $key, mixed $default = null): mixed
    {
        try {
            return Cache::remember("setting:{$key}", 3600, function () use ($key, $default) {
                $setting = static::where('key', $key)->first();
                return $setting ? $setting->getCastedValue() : $default;
            });