app/Models/User.php

    public function getTotalSpentAttribute(): float
    {
        return (float) $this->orders()->where('payment_status', 'paid')->sum('total');
---
select sum("total") as aggregate from "orders" where "orders"."user_id" = 2 and "orders"."user_id" is not null and "payment_status" = 'paid' and "orders"."deleted_at" is null