app/Filament/Pages/Settings.php

    public function mount(): void
    {
        $settings = Setting::all()->keyBy('key');
---
select * from "settings"